{
    "basics": {
        "name": "Rémi Staelen",
        "label": "Master's Student: Data Management in Biosciences",
        "image": "",
        "email": "remistpro@gmail.com",
        "phone": "06 28 47 65 89",
        "url": "",
        "summary": "Also holding a Master's degree (Bac+5) in AI Project Management, with three years of work-study experience and two internships in the data field (Data Engineer, Data Analyst, Data Scientist). I have a strong interest in the world of data applied particularly to biology and I want to evolve in environments where these skills create real value.",
        "location": {
            "city": "Villeneuve-d'Ascq",
            "country": "France",
            "postalCode": "59650"
        },
        "profiles": []
    },
    "objective": {
        "title": "Looking for Internship",
        "role": "Data Analyst / Data Engineer / Data Scientist in Health",
        "duration": "2 to 5 months",
        "availability": "From March 30, 2026",
        "note": "Possibility of work-study for the second year starting September 2026"
    },
    "education": [
        {
            "institution": "EDN - Catholic University of Lille",
            "area": "Master Data Management in Biosciences",
            "studyType": "Master",
            "startDate": "2025",
            "endDate": "Present",
            "description": "Bioinformatics, biostatistics, molecular and cellular biology",
            "location": "Lille"
        },
        {
            "institution": "EPSI Lille",
            "area": "Master's in AI Project Management",
            "studyType": "Master",
            "startDate": "2023",
            "endDate": "2025",
            "location": "Lille"
        },
        {
            "institution": "EPSI Lille",
            "area": "Bachelor Application Designer and Developer",
            "studyType": "Bachelor",
            "startDate": "2022",
            "endDate": "2023",
            "location": "Lille"
        },
        {
            "institution": "EPSI Lille",
            "area": "HND in Software Solutions and Business Applications",
            "studyType": "HND",
            "startDate": "2020",
            "endDate": "2022",
            "location": "Lille"
        },
        {
            "institution": "Gustave Eiffel High School",
            "area": "Engineering Sciences",
            "studyType": "High School Diploma",
            "startDate": "2020",
            "endDate": "2020",
            "description": "European English Section",
            "location": "Armentières"
        }
    ],
    "experience": [
        {
            "company": "Reconomia",
            "position": "Data Engineer / Analyst / Scientist Apprentice",
            "startDate": "September 2023",
            "endDate": "August 2025",
            "highlights": [
                "Implementation of a Data Lakehouse architecture (Bronze/Silver/Gold) on Microsoft Fabric",
                "End-to-end development of an AI model for predicting appliance breakdowns (XGBoost)",
                "Industrialization and deployment of the model via an API on Azure Machine Learning with CI/CD pipeline",
                "Creation of strategic dashboard (KPIs) on Power BI",
                "Automation of quarterly tonnage exports and reports enabling financial support recovery from an eco-organization",
                "Audit and cleaning of large datasets (Big Data After-Sales Service) for predictive model training"
            ]
        },
        {
            "company": "Daweiro",
            "position": "Data Engineer / Analyst Apprentice",
            "startDate": "July 2022",
            "endDate": "September 2023",
            "highlights": [
                "Design and deployment of a Serverless Cloud architecture on AWS (Lambda, S3) for social trend monitoring",
                "Development of automated data ingestion pipelines and structuring into a queryable Data Lake via Amazon Athena",
                "Integration of AWS AI services for semantic and visual analysis of viral content",
                "Development of a Front-End web application in ReactJS for trend restitution and filtering",
                "Implementation of Infrastructure as Code (IaC) via Terraform to automate Cloud resource deployment",
                "Creation of decision-making dashboards on Amazon QuickSight for tracking virality KPIs"
            ]
        },
        {
            "company": "PELOPS",
            "position": "Fullstack Developer & AI Engineer Intern",
            "startDate": "January 2022",
            "endDate": "February 2022",
            "highlights": [
                "Fullstack development of an HRIS candidate tracking module on React.js and Symfony",
                "Design of a dynamic recruitment process management interface (Progress bars, state management)",
                "Implementation of interactive forms linked to a PostgreSQL database via API Platform",
                "AI R&D: Creation of a CV parsing model (NLP) with Python and spaCy for automatic skill extraction",
                "Collaborative project management with Git and Trello"
            ]
        },
        {
            "company": "AllYouNeed",
            "position": "Back-end Developer Intern",
            "startDate": "May 2021",
            "endDate": "June 2021",
            "highlights": [
                "Design and development of a secure authentication module (Login/Register) in native PHP coupled with a MySQL database",
                "Application security: implementation of password hashing and protection against SQL injections and XSS vulnerabilities",
                "Refactoring and code optimization (Clean Code) by separating business logic and display to facilitate maintenance",
                "Implementation of development best practices: versioning with Git/GitHub and respect for the DRY principle",
                "Integration of third-party APIs (SMS/Microsoft) and initiation to Cloud services (AWS) and Symfony framework"
            ]
        }
    ],
    "skills": [
        {
            "category": "Data Science & AI",
            "subgroups": [
                {
                    "name": "Machine Learning",
                    "items": [
                        "Scikit-Learn",
                        "PyTorch",
                        "XGBoost",
                        "LightGBM",
                        "Bayesian Optimization"
                    ]
                },
                {
                    "name": "NLP",
                    "items": [
                        "SpaCy",
                        "NER"
                    ]
                },
                {
                    "name": "Analysis & Viz",
                    "items": [
                        "Python (Pandas, NumPy)",
                        "Power BI",
                        "QuickSight",
                        "Excel"
                    ]
                }
            ]
        },
        {
            "category": "Data Engineering & Cloud",
            "subgroups": [
                {
                    "name": "Cloud Platforms",
                    "items": [
                        "Cloud Infrastructure Implementation",
                        "AWS (Lambda, S3, Athena, RDS, VPC, IAM, SNS, SQS, CloudWatch)",
                        "Azure (ML, Foundry, Data Factory, Blob storage, Key Vault)",
                        "Microsoft Fabric (Dataflows, Power BI, Lakehouse)"
                    ]
                },
                {
                    "name": "Databases",
                    "items": [
                        "SQL (PostgreSQL, MySQL)",
                        "Data Lake",
                        "Data Warehouse",
                        "Modeling (Lambda/Kappa)"
                    ]
                },
                {
                    "name": "DevOps & Tools",
                    "items": [
                        "Terraform (IaC)",
                        "CI/CD",
                        "Git/GitHub (Actions)",
                        "Docker"
                    ]
                }
            ]
        },
        {
            "category": "Bioinformatics",
            "subgroups": [
                {
                    "name": "Tools & Libraries",
                    "items": [
                        "BioPython",
                        "R"
                    ]
                },
                {
                    "name": "Domains",
                    "items": [
                        "Genomics",
                        "Biostatistics",
                        "Molecular Biology"
                    ]
                }
            ]
        },
        {
            "category": "Soft Skills & Management",
            "subgroups": [
                {
                    "name": "Project Management",
                    "items": [
                        "Resource Management",
                        "Risk Analysis and Management",
                        "Change Management",
                        "Specifications",
                        "Feasibility Study",
                        "Needs Assessment"
                    ]
                },
                {
                    "name": "Soft Skills",
                    "items": [
                        "Autonomy (learning and execution)",
                        "Teamwork (collaboration and communication)",
                        "Adaptability",
                        "Understanding Needs"
                    ]
                },
                {
                    "name": "Languages",
                    "items": [
                        "French (Native)",
                        "English (C1)"
                    ]
                }
            ]
        }
    ],
    "interests": [
        {
            "name": "Drums",
            "description": "8 years (including 3 years in a band)"
        },
        {
            "name": "Piano",
            "description": "1 year"
        },
        {
            "name": "Culture",
            "description": "Art and Natural Science Museums"
        },
        {
            "name": "Sport",
            "description": "Calisthenics"
        },
        {
            "name": "Formula 1",
            "description": "Motorsport enthusiast"
        }
    ],
    "projects": [
        {
            "title": "NeuroSift",
            "subtitle": "MRI Classification Pipeline (End-to-End)",
            "image": "/images/projects/neurosift/app.png",
            "url": "https://github.com/Remistln/Neurosift",
            "description": "Development of a complete processing chain for medical image analysis using Deep Learning. Simulation of a diagnostic aid pipeline.",
            "longDescription": "In daily radiological workflows, the manual sorting of MRI sequences (T1, T2, FLAIR) is a time-consuming and repetitive task, yet essential prior to any diagnosis. NeuroSift aims to automate this upstream 'triage' step, allowing practitioners to dedicate their expertise to pathological analysis rather than data management. The major technical objective was to design a realistic 'end-to-end' infrastructure capable of simulating a clinical production environment. The pipeline thus manages the complete lifecycle of medical data: from the automated ingestion of complex cohorts (Glioblastoma) and DICOM metadata cleaning, to advanced pre-processing normalizing inter-machine variabilities, finally delivering reliable predictions via an ergonomic radiologist interface.",
            "tags": [
                "Deep Learning",
                "PyTorch",
                "Computer Vision",
                "Docker",
                "Medical Imaging"
            ],
            "steps": [
                {
                    "title": "1. Ingestion & Data Engineering",
                    "content": "Development of an automated extraction pipeline via the TCIA API to dynamically retrieve the UPENN-GBM cohort. The system parses the often chaotic native DICOM tree to structure a clean, hierarchical local Data Lake (Patient > Study > Series)."
                },
                {
                    "title": "2. Advanced Medical Pre-processing",
                    "content": "Handling raw data unsuitable for classic CNNs. I implemented 16-bit reading via Pydicom followed by Adaptive Percentile Normalization (1-99%) to harmonize contrasts between different MRI machines, before final conversion to standardized 8-bit format."
                },
                {
                    "title": "3. Modeling (Deep Learning)",
                    "content": "Adoption of a Transfer Learning strategy on a ResNet18 architecture to overcome 'Small Data' limitations. Training uses Adam optimizer and Cross-Entropy Loss, validated by a strict 'Patient-Level Split' to ensure the model generalizes to new anatomies without memorization."
                },
                {
                    "title": "4. Infrastructure & MLOps",
                    "content": "Design of a 'Cloud-Ready' Micro-services architecture orchestrated by Docker Compose. The system includes decoupled image storage via MinIO (S3-compatible), a PostgreSQL database for metadata, and an interactive Streamlit interface for the clinician."
                }
            ],
            "challenges": [
                {
                    "title": "Contrast Bias (Semantic Ambiguity)",
                    "content": "A T1 series with Gadolinium injection incorrectly classified as FLAIR (Confidence > 99%). The model learned hyper-intensity (white) as a FLAIR signature, missing the acquisition protocol context."
                },
                {
                    "title": "Distribution Drift (Edge Case)",
                    "content": "Performance drop (Confidence ~50%) on orbital cuts (skull base). These areas contain structures (eyes, sinuses) under-represented in the brain-centered dataset, illustrating an Out-of-Distribution case."
                }
            ],
            "stack": {
                "Framework": "PyTorch, Torchvision",
                "Computer Vision": "OpenCV, Pydicom",
                "Data Engineering": "Pandas, SQLAlchemy",
                "Infrastructure": "Docker, MinIO, PostgreSQL, MLflow",
                "Interface": "Streamlit"
            },
            "gallery": [
                {
                    "src": "/images/projects/neurosift/app.png",
                    "caption": "NeuroSift Interface: Real-time analysis of a T1 sequence"
                },
                {
                    "src": "/images/projects/neurosift/prediction.png",
                    "caption": "Prediction overview and region of interest"
                },
                {
                    "src": "/images/projects/neurosift/confusion_matrix.png",
                    "caption": "Confusion Matrix: Performance validation on test set"
                }
            ]
        },
        {
            "title": "BioSeq-Analyzer",
            "subtitle": "Bioinformatics Analysis Suite & Protein Characterization",
            "image": "/images/projects/bioseq/dotplot.png",
            "url": "https://github.com/Remistln/BioSeq-Analyzer",
            "description": "An interactive platform unifying multimodal sequence analysis. From pair-wise DNA alignment to structural protein characterization via UniProt.",
            "longDescription": "Biological sequence analysis often requires juggling between obscure command-line scripts and fragmented web portals. BioSeq-Analyzer centralizes these workflows in a robust Streamlit application. Designed to facilitate genomic and proteomic exploration, the tool allows researchers to statistically validate sequence alignments, dynamically translate nucleic acids into proteins (ORF finding), and automatically retrieve rich functional metadata. The architecture relies on seamless integration of major domain APIs (NCBI Entrez, UniProt), transforming raw FASTA data into actionable biological insights (AlphaFold 3D structures, associated literature, functional domains) in a few clicks.",
            "tags": [
                "Bioinformatics",
                "Streamlit",
                "Biopython",
                "API Integration",
                "Data Visualization"
            ],
            "steps": [
                {
                    "title": "1. Ingestion & Algorithmic Alignment",
                    "content": "Support for standard FASTA format with parsing via Biopython. Implementation of configurable global (Needleman-Wunsch) and local (Smith-Waterman) alignment algorithms. Addition of a statistical validation layer using Monte-Carlo method (50+ shuffles) to distinguish real biological similarities from random noise."
                },
                {
                    "title": "2. Structural Visualization (Dotplots)",
                    "content": "Development of a customized matrix visualization engine (Dotplot) with Matplotlib. The user can filter visual noise by dynamically adjusting sliding window sizes and stringency thresholds to reveal repeats, inversions, and conserved domains."
                },
                {
                    "title": "3. Translation & ORF Discovery",
                    "content": "Open Reading Frame (ORF) detection algorithm on 6 frames (Forward/Reverse). The system intelligently identifies the most probable protein candidate (based on length and START/STOP codons) and allows cross-validation via BLASTN against RefSeq transcriptomic databases."
                },
                {
                    "title": "4. Functional Enrichment (UniProt)",
                    "content": "Real-time connection to the UniProtKB API to enrich identified sequences. The application aggregates and presents in a structured manner: subcellular localization, associated pathologies, InterPro domains, and links to AlphaFold structure predictions."
                }
            ],
            "challenges": [
                {
                    "title": "State Management & API Latency",
                    "content": "Synchronous querying of massive databases (NCBI BLAST) can freeze the interface. I had to implement fine-grained Streamlit `session_state` management and caching mechanisms to preserve user experience fluidity while handling timeouts and rate limiting."
                },
                {
                    "title": "Alignment Score Normalization",
                    "content": "A raw alignment score is difficult to interpret without context. Integrating the randomization test (shuffling) required optimizing Numpy calculation loops to generate a reference distribution on the fly without impacting tool reactivity."
                }
            ],
            "stack": {
                "Frontend": "Streamlit",
                "Core Logic": "Biopython, Pandas",
                "Scientific Stack": "NumPy, Matplotlib",
                "External APIs": "NCBI Entrez (Bio.Entrez), UniProt REST",
                "Security": "SSL Context Management"
            },
            "gallery": [
                {
                    "src": "/images/projects/bioseq/dotplot.png",
                    "caption": "Matrix visualization (Dotplot) for detection of repeats and homologies"
                },
                {
                    "src": "/images/projects/bioseq/alignment.png",
                    "caption": "Optimal sequence alignment (Global/Local) with substitution matrix"
                },
                {
                    "src": "/images/projects/bioseq/most_likely_protein.png",
                    "caption": "ORF Detection Algorithm: Identification of the most probable protein candidate"
                },
                {
                    "src": "/images/projects/bioseq/prot_association.png",
                    "caption": "Protein identification in the NCBI database using BLAST"
                }
            ]
        },
        {
            "title": "Patient Performance Overview",
            "subtitle": "Hospital Analytics Dashboard & KPIs",
            "image": "/images/projects/patient_performance_overview/home.png",
            "description": "Business Intelligence dashboard for hospital performance monitoring. Multidimensional analysis of patient distribution, departmental efficiency, and satisfaction.",
            "longDescription": "In a high-pressure hospital environment, visibility into patient flow is critical. This Power BI project transforms raw admission and treatment data into actionable insights. The report enables administrators to track key indicators (Average Length of Stay, Occupancy Rate, Satisfaction) in real-time and filter these metrics by department or practitioner. The interface is designed for intuitive navigation, simulating a web application experience within the BI tool.",
            "tags": [
                "Power BI",
                "DAX",
                "Data Modeling",
                "UX Design",
                "Healthcare"
            ],
            "steps": [
                {
                    "title": "1. Star Schema Modeling",
                    "content": "Design of a robust data model: separation of fact tables (Admissions, Consultations) and dimensions (Time, Patients, Departments) to ensure fast cross-filtering performance."
                },
                {
                    "title": "2. Advanced DAX Measures",
                    "content": "Development of complex DAX measures for dynamic KPIs: Time Intelligence (YTD, YoY), moving averages for trends, and calculation groups for dynamic metric switching."
                },
                {
                    "title": "3. Design & Navigation",
                    "content": "Creation of a fluid user experience using Bookmarks and navigation buttons. Use of custom backgrounds (Figma) to break away from the standard Power BI 'grid' look."
                },
                {
                    "title": "4. Patient Journey Analysis",
                    "content": "Visualization of care pathway bottlenecks via decomposition trees and service performance matrices."
                }
            ],
            "stack": {
                "BI Tool": "Microsoft Power BI",
                "Languages": "DAX, M (Power Query)",
                "Data Source": "Excel / SQL",
                "Design": "Figma (Backgrounds)"
            },
            "gallery": [
                {
                    "src": "/images/projects/patient_performance_overview/home.png",
                    "caption": "Overview: Macro KPIs and trend indicators"
                },
                {
                    "src": "/images/projects/patient_performance_overview/Home2.png",
                    "caption": "Alternative View: Secondary performance indicators"
                },
                {
                    "src": "/images/projects/patient_performance_overview/department.png",
                    "caption": "Detailed Department Analysis (Flow & Efficiency)"
                },
                {
                    "src": "/images/projects/patient_performance_overview/patient.png",
                    "caption": "Patient Focus: Admissions detail and history"
                },
                {
                    "src": "/images/projects/patient_performance_overview/patient2.png",
                    "caption": "Patient Detail: In-depth view and clinical history"
                },
                {
                    "src": "/images/projects/patient_performance_overview/performance.png",
                    "caption": "Performance Matrix and Decomposition Tree"
                }
            ]
        }
    ]
}